{ "blogs": [{
    "title": "Hiking After Dark",
    "review":"If you don’t carry a headlamp with you on hikes, you really should, together with a spare set of batteries. The consequences of not having a headlamp if you need one are simply too high to risk it. I go as far as to carry two headlamps on hikes including spare batteries, but I do a lot of very long, high mileage day hikes and bushwhacks that often end with a hike out after sunset. Bringing a second headlamp means that I can quickly switch between the two without fumbling around in the dark. The two headlamps I use are a Black Diamond Icon and a Black Diamond Spot. The Icon is insanely bright, throws a 100 meter beam, and lasts up to 75 hours on its high setting. While heavier than the Spot because it has an external battery pack, it’s worth carrying because I find that my eyes need a lot of light to see at night. I carry the Spot as a SOL backup and mainly use it inside  my shelter when I want something less bright and easier to sleep with in my sleeping bag or quilt. If it’s clear that darkness is going to fall before I’m off the trail, I take my headlamp out of my pack about 30 minutes before sunset, so I can have it easily at hand before complete darkness descends. It’s hard to predict exactly when it will become too dark to see and I don’t want to have to stop and fumble around in my pack for a headlamp in the dark."
  }, {
    "title": "Dealing with Bears!",
    "review": "Remain calm and ready your bear spray (or other deterrent). Stay together if you are in a group; you will appear larger and more intimidating if you stick together. Try to figure out whether the bear is a grizzly or a black bear. As you will see below, grizzly bears and black bears tend to behave differently in a given situation, so it helps to know which species you’re dealing with. (Click here to learn how to tell the difference.) If possible, try to determine whether there are cubs present or whether the bear is defending an animal carcass or other food source. Females with cubs or bears defending food sources may appear to act aggressively as they defend their cubs and/or food."
  }, {
    "title": "Living in a tree",
    "review": "Gone are the days when treehouses were mere hideouts, forts or magical places enjoyed only by children. These days, tree houses are in vogue with adults, too, be they eco-minded off-gridders, indie-spirited yuppies, or retirement-inclined baby boomers. All around the world, luxury lodges, hotels, palatial retreats, schools and even churches can now be found nestled comfortably atop trees. In the Western world where treehouses are not customary places of dwelling as they are for native tribes of Southeast Asia and the South Pacific, treehouse-living has been rising in popularity in recent years. Eco-lodges aptly called tree-sorts” that are sprouting up in Costa Rica, India and many developing countries have been designed to cater specifically to tourists from the first world. Indeed, most of us never really lose our sense of wonder and adventure, or that playful inner child in us – no matter what age. Living high does bring a natural high, so given the opportunity, many of us wouldn’t mind being Tarzans and Janes for a few hours (or a few days) and literally live it up in the canopies. Whether it’s a yearning to escape the crowd and get some peace and quiet, or pursue an ideal to live more sustainably, or just simply try and get closer to nature, more and more people are finding reasons to go off-grid and high above-ground. From simple one-deck shacks made out of recycled materials, to deluxe, multi-story affairs carefully designed by professional architects – treehouses are definitely trending. On the high-end, just Google luxury tree houses and you’ll soon be swamped with pages upon pages of construction and design websites featuring the latest, most innovative and grandiose treehouses rising up in the far, exotic corners of the world. Castle-like structures. Snake-shaped dwellings. Spherical domes. The list goes on. Arboreal abodes are evolving into shapes and sizes nobody’s ever dreamed of."
}],
  "trails": [{
    "name": "Angel's Rest Loop",
    "difficulty": "Hard",
    "image": "https://wyeastblog.files.wordpress.com/2013/08/angelsrestloop01.jpg",
    "trail-link": "https://www.alltrails.com/trail/us/oregon/angels-rest-loop-trail"
  }, {
    "name": "Trail of Ten",
    "difficulty": "Moderate",
    "image": "http://www.deanmyerson.org/files/photo%20archive/2013/sf/silverfalls%20013.jpg",
    "trail-link": "http://www.deanmyerson.org/silver-falls"
  }, {
    "name": "Eagle Creek",
    "difficulty": "Moderate",
    "image": "http://jaysjourneys.com/wp-content/uploads/2011/06/3034164350_f009ba254c.jpg",
    "trail-link": "http://jaysjourneys.com/2008/11/15/eagle-creek-trail-and-tunnel-falls/"
    }]
}
